name: "yolov8x-cls-imagenet"
platform: "pytorch_libtorch"
default_model_filename: "yolov8x-cls.pt"

input [
  {
    name: "input__0"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224 ]
    reshape { shape: [ 1, 3, 224, 224 ] }
  }
]
output [
  {

    name: "output__0"
    data_type: TYPE_FP32
    dims: [1, 1000]
  }
]